app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT 1  [["question_id", 1], ["id", "1"]]
---
  def show
    @answer = @question.answers.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT 1  [["question_id", 1], ["id", "1"]]
---
  def edit
    @answer = @question.answers.find(params[:id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."id" ASC LIMIT 1  [["id", 1]]
---
    def find_the_question
      @question = Question.find(params[:question_id])