app/controllers/offerings_controller.rb

  def index
    @offerings = Offering.all
---
SELECT "offerings".* FROM "offerings"

    def set_offering
      @offering = Offering.find(params[:id])
---
SELECT "offerings".* FROM "offerings" WHERE "offerings"."id" = ? LIMIT 1  [["id", "1"]]