app/controllers/questions_controller.rb

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Oct 2013 21:29:20 UTC +00:00], ["name", "q2"], ["updated_at", Mon, 28 Oct 2013 21:29:20 UTC +00:00]]