app/controllers/user_question_sets_controller.rb

SELECT "user_question_sets".* FROM "user_question_sets"
---
  def index
    @user_question_sets = UserQuestionSet.all