app/controllers/user_enrollments_controller.rb

SELECT "user_enrollments".* FROM "user_enrollments"
---
  def index
    @user_enrollments = UserEnrollment.all

SELECT "user_enrollments".* FROM "user_enrollments" WHERE "user_enrollments"."user_id" = ? ORDER BY "user_enrollments"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user_enrollment
      if current_user
        @user_enrollment = current_user.user_enrollment
      else
        @user_enrollment = UserEnrollment.find(params[:id])